In [1]:
import pandas as pd
import numpy as np

In [ ]:
s = pd.Series({'a':10,'b' :20, 'c' : 30})
print(s.type)

In [ ]:
s.index

In [5]:
s1 = pd.Series([10,20,30,40])
s1

0    10
1    20
2    30
3    40
dtype: int64

In [6]:
s1.index

RangeIndex(start=0, stop=4, step=1)

In [7]:
s1.max()

40

In [9]:
s1.describe()

count     4.000000
mean     25.000000
std      12.909944
min      10.000000
25%      17.500000
50%      25.000000
75%      32.500000
max      40.000000
dtype: float64

In [12]:
#Generacion de una serie de numeros aleatorios
s2 = pd.Series(np.random.randn(5))
s2

0   -1.752500
1   -1.593818
2   -2.081264
3    1.093159
4   -0.595991
dtype: float64

In [13]:
s2

0   -1.752500
1   -1.593818
2   -2.081264
3    1.093159
4   -0.595991
dtype: float64

In [14]:
#Se pueden combinar varias cosas
s3 = pd.Series([[10, 20],\
                [30, 40.5,'series'],\
                [50, 55],\
                {'Name':'Tess','Org':'Packt'}])
s3

0                            [10, 20]
1                  [30, 40.5, series]
2                            [50, 55]
3    {'Name': 'Tess', 'Org': 'Packt'}
dtype: object

In [15]:
s3[1]

[30, 40.5, 'series']

In [16]:
#Elemento 1 del indice 1
s3[1][1]

40.5

In [17]:
s3.describe()
#no puede dar datos estadisticos, pero da los objetos que lo componen

count            4
unique           4
top       [10, 20]
freq             1
dtype: object

In [18]:
s3[1][1]

40.5

In [19]:
s3.shape
#indica la forma que tiene nuestro objeto, indica el numero de renglones y el numero de columnas ( al no haber ninguna columna l pone en blanco)

(4,)

In [23]:
df = pd.DataFrame([30,50,20])
#objeto diferente compuesto de varios elemento
print(type(df))
print(df.shape)

<class 'pandas.core.frame.DataFrame'>
(3, 1)

In [24]:
df

    0
0  30
1  50
2  20

In [25]:
df.columns
#lista de elementos para listar las columnas

RangeIndex(start=0, stop=1, step=1)

In [26]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [27]:
list(df.index)

[0, 1, 2]

In [28]:
print("Las columnas del dataFrame son:",list(df.columns))
print("Los indices de renglones del dataFrame son:",list(df.index))

Las columnas del dataFrame son: [0]
Los indices de renglones del dataFrame son: [0, 1, 2]

In [29]:
df.columns = ["C1"]
df.index = ["R1","R2","R3"]
df

    C1
R1  30
R2  50
R3  20

In [31]:
df["C1"]

R1    30
R2    50
R3    20
Name: C1, dtype: int64

In [33]:
l = [(0, 1, 2), (1, 2, 3), (4, 5, 6), (7, 8, 9)]
df1 = pd.DataFrame(data=l)
print(df1.shape)
df1

(4, 3)

   0  1  2
0  0  1  2
1  1  2  3
2  4  5  6
3  7  8  9

In [34]:
l1 = [(0, 1, 2), (1, 2, 3), (4, 5, 6), (7, 8, 9,10)]
df12 = pd.DataFrame(data=l1)
print(df12.shape)
df12

(4, 4)

   0  1  2     3
0  0  1  2   NaN
1  1  2  3   NaN
2  4  5  6   NaN
3  7  8  9  10.0

In [37]:
l = [(0, 1, 2), (1, 2, 3), (4, 5, 6), (7, 8, 9)]
df1 = pd.DataFrame(data=l,
                  columns= ["C1","C2","C3"],
                  index =["R1","R2","R3","R4"]
                  )
df1

    C1  C2  C3
R1   0   1   2
R2   1   2   3
R3   4   5   6
R4   7   8   9

In [38]:
df1.describe()

             C1        C2        C3
count  4.000000  4.000000  4.000000
mean   3.000000  4.000000  5.000000
std    3.162278  3.162278  3.162278
min    0.000000  1.000000  2.000000
25%    0.750000  1.750000  2.750000
50%    2.500000  3.500000  4.500000
75%    4.750000  5.750000  6.750000
max    7.000000  8.000000  9.000000

In [40]:

df12.describe()

              0         1         2     3
count  4.000000  4.000000  4.000000   1.0
mean   3.000000  4.000000  5.000000  10.0
std    3.162278  3.162278  3.162278   NaN
min    0.000000  1.000000  2.000000  10.0
25%    0.750000  1.750000  2.750000  10.0
50%    2.500000  3.500000  4.500000  10.0
75%    4.750000  5.750000  6.750000  10.0
max    7.000000  8.000000  9.000000  10.0

In [42]:
d = {'py101':[10, 5, 33 ,45, 25, 22], 
                'py111':[0, 15, 21 , 30, 31, 11], 
                'py121':[15, 5, 1 ,10, 42, 21], 
                'py301':(20, 35, 3 ,15, 0, 0), }
meses = ('enero', 'febrero', 'marzo', 'abril', 'mayo', 'junio')
df4 = pd.DataFrame(data=d, index=meses)
df4

#Se pueden poner tuplas y las acepta igual

         py101  py111  py121  py301
enero       10      0     15     20
febrero      5     15      5     35
marzo       33     21      1      3
abril       45     30     10     15
mayo        25     31     42      0
junio       22     11     21      0

   m=np.arange(9)
   m

In [44]:
m=np.arange(9).reshape(3,3)
m

array([[0, 1, 2],
       [3, 4, 5],
       [6, 7, 8]])


#####

In [48]:
df5 = pd.DataFrame(m, index=["uno","dos","tres"],columns=["C1",2,"C3"])
df5

      C1  2  C3
uno    0  1   2
dos    3  4   5
tres   6  7   8

In [49]:
df5.columns

Index(['C1', 2, 'C3'], dtype='object')

In [51]:
df6 = pd.DataFrame(data=d, index=meses, columns=['mesas','py101','bancos','puertas'])
df6

        mesas  py101 bancos puertas
enero     NaN     10    NaN     NaN
febrero   NaN      5    NaN     NaN
marzo     NaN     33    NaN     NaN
abril     NaN     45    NaN     NaN
mayo      NaN     25    NaN     NaN
junio     NaN     22    NaN     NaN

In [53]:
df7 = pd.DataFrame(data=d, index=meses)
df7

         py101  py111  py121  py301
enero       10      0     15     20
febrero      5     15      5     35
marzo       33     21      1      3
abril       45     30     10     15
mayo        25     31     42      0
junio       22     11     21      0

In [55]:
df7.rename (index={'febrero':'feb','mayo':'may'}, inplace=True)
df7

       py101  py111  py121  py301
enero     10      0     15     20
feb        5     15      5     35
marzo     33     21      1      3
abril     45     30     10     15
may       25     31     42      0
junio     22     11     21      0

In [56]:
df7.rename (index={'feb':'febrero','may':'mayo'},columns={'SI':'PROG1'}, inplace=True)
df7

         py101  py111  py121  py301
enero       10      0     15     20
febrero      5     15      5     35
marzo       33     21      1      3
abril       45     30     10     15
mayo        25     31     42      0
junio       22     11     21      0

In [58]:
df7['POO']

KeyError: 'POO'

In [59]:
df7[:3]

         py101  py111  py121  py301
enero       10      0     15     20
febrero      5     15      5     35
marzo       33     21      1      3

In [60]:
df7[::2] #De inicio a final, pero con saltos de 2 en 2

       py101  py111  py121  py301
enero     10      0     15     20
marzo     33     21      1      3
mayo      25     31     42      0

In [61]:
df = pd.DataFrame({'nombres':('Juan Pérez',
                                 'María Sánchez'
                                 , 'Jorge Vargas',
                                 'Rodrigo Martínez'),
            'fechas':(datetime(1995,12,21), 
                      datetime(1989,1,13), 
                      datetime(1992,9,14), 
                      datetime(1993,7,8)),
            'saldo': (2500, 
                      5345, 
                      np.NaN, 
                      11323.2),
            'al_corriente':(True, 
                            True, 
                            False, 
                            True)})

NameError: name 'datetime' is not defined

In [62]:
from datetime import datetime

In [63]:
df = pd.DataFrame({'nombres':('Juan Pérez',
                                 'María Sánchez'
                                 , 'Jorge Vargas',
                                 'Rodrigo Martínez'),
            'fechas':(datetime(1995,12,21), 
                      datetime(1989,1,13), 
                      datetime(1992,9,14), 
                      datetime(1993,7,8)),
            'saldo': (2500, 
                      5345, 
                      np.NaN, 
                      11323.2),
            'al_corriente':(True, 
                            True, 
                            False, 
                            True)})

In [65]:
df.dtypes

nombres                 object
fechas          datetime64[ns]
saldo                  float64
al_corriente              bool
dtype: object

In [66]:
df

            nombres     fechas    saldo  al_corriente
0        Juan Pérez 1995-12-21   2500.0          True
1     María Sánchez 1989-01-13   5345.0          True
2      Jorge Vargas 1992-09-14      NaN         False
3  Rodrigo Martínez 1993-07-08  11323.2          True

In [67]:
df.describe()

             saldo
count      3.00000
mean    6389.40000
std     4503.36464
min     2500.00000
25%     3922.50000
50%     5345.00000
75%     8334.10000
max    11323.20000

In [68]:
df['saldo'].describe()

count        3.00000
mean      6389.40000
std       4503.36464
min       2500.00000
25%       3922.50000
50%       5345.00000
75%       8334.10000
max      11323.20000
Name: saldo, dtype: float64

In [70]:
df.dtypes

nombres                 object
fechas          datetime64[ns]
saldo                  float64
al_corriente              bool
dtype: object

In [1]:
df7.columns = ['BD', 'TEBD', 'UML', 'JAVA']

NameError: name 'df7' is not defined

In [2]:
df7.rename(columns={'UML':'SI', 'JAVA':'POO'}, inplace=True)
df7

NameError: name 'df7' is not defined

In [6]:
df12 = pd.DataFrame(data=d, index=meses)

NameError: name 'pd' is not defined